Display the status of CDP on R1.

R1# show cdp

% CDP is not enabled
R1#


Enter Global Configuration mode to configure the following:
Enable CDP globally on R1.
Disable CDP on interface S0/0/0.
Use end command to exit Global Configuration mode.

R1# configure terminal
R1(config)# cdp run
R1(config)# interface s0/0/0
R1(config-if)# no cdp enable
R1(config-if)# end
R1#


Display the list of CDP neighbors on R1.

R1# show cdp neighbors
Capability Codes: R - Router, T - Trans Bridge, B - Source Route Bridge
                  S - Switch, H - Host, I - IGMP, r - Repeater, P - Phone,
                  D - Remote, C - CVTA, M - Two-port Mac Relay

Device ID        Local Intrfce     Holdtme    Capability  Platform  Port ID
S1               Gig 0/1           122              S I   WS-C2960- Fas 0/5


Display more details from the list of CDP neighbors on R1.

R1# show cdp neighbors detail

-------------------------
Device ID: S1
Entry address(es):
  IP address: 192.168.1.2
Platform: cisco WS-C2960-24TT-L,  Capabilities: Switch IGMP
Interface: GigabitEthernet0/1,  Port ID (outgoing port): FastEthernet0/5
Holdtime : 136 sec

Version :
Cisco IOS Software, C2960 Software (C2960-LANBASEK9-M), Version 15.0(2)SE7, RELEASE SOFTWARE (fc1)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2014 by Cisco Systems, Inc.
Compiled Thu 23-Oct-14 14:49 by prod_rel_team

advertisement version: 2
Protocol Hello:  OUI=0x00000C, Protocol ID=0x0112; payload len=27, value=00000000FFFFFFFF010221FF000000000000002291210380FF0000
VTP Management Domain: ''
Native VLAN: 1
Duplex: full
Management address(es):
  IP address: 192.168.1.2


Total cdp entries displayed : 1

You have successfully configured and verified CDP.

************************** LLDP *******************************

Display the status of LLDP on R1.

R1# show lldp
% LLDP is not enabled
R1#


Enter Global Configuration mode to configure the following:
Enable LLDP globally on R1.
Disable LLDP on interface S0/0/0.
Use end command to exit Global Configuration mode.

R1# configure terminal
R1(config)# lldp run
R1(config)# interface s0/0/0
R1(config-if)# no lldp transmit
R1(config-if)# end
R1#


Display the list of LLDP neighbors on S1.

S1# show lldp neighbors
Capability codes:
    (R) Router, (B) Bridge, (T) Telephone, (C) DOCSIS Cable Device
    (W) WLAN Access Point, (P) Repeater, (S) Station, (O) Other

Device ID           Local Intf     Hold-time  Capability      Port ID
R1                  Fa0/5          99         R               Gi0/1

Total entries displayed: 1


Display more details from the list of LLDP neighbors on S1.

S1# show lldp neighbors detail

------------------------------------------------
Chassis id: c471.fe45.73a0
Port id: Gi0/1
Port Description: GigabitEthernet0/1
System Name: R1

System Description:
Cisco IOS Software, C1900 Software (C1900-UNIVERSALK9-M), Version 15.4(3)M2, RELEASE SOFTWARE (fc2)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2015 by Cisco Systems, Inc.
Compiled Fri 06-Feb-15 17:01 by prod_rel_team

Time remaining: 106 seconds
System Capabilities: B,R
Enabled Capabilities: R
Management Addresses - not advertised
Auto Negotiation - not supported
Physical media capabilities - not advertised
Media Attachment Unit type - not advertised
Vlan ID: - not advertised


Total entries displayed: 1
You have successfully configured and verified LLDP.


****************************** NTP **************************

Display the clock using the detail option on R1.

R1# show clock detail
.18:11:26.172 UTC Tue Dec 1 2015
No time source

R1#


Enter Global Configuration mode on R1 to configure the following:
Set the clock time zone to PST (Pacific Standard Time), which is 8 hours later than GMT (-8).
Set PDT (Pacific Daylight Time) to summer time recurring.
Use end command to exit Global Configuration mode.
Re-display the clock using the detail option.

R1# configure terminal
R1(config)# clock timezone PST -8
R1(config)# Clock summer-time PDT recurring
R1(config)# end
R1# show clock detail
.10:25:36.304 PST Tue Dec 1 2015
No time source
Summer time starts 02:00:00 PST Sun Mar 13 2016
Summer time ends 02:00:00 PDT Sun Nov 6 2016


Enter Global Configuration mode to configure the following:
Configure R1 to use an external public NTP server with an IP address of 209.165.200.225.
Use end command to exit Global Configuration mode.
Re-display the clock using the detail option.

R1# configure terminal
R1(config)# ntp server 209.165.200.225
R1(config)# end
R1# show clock detail
13:23:32.648 PST Tue Dec 1 2015
Time source is NTP
Summer time starts 02:00:00 PST Sun Mar 13 2016
Summer time ends 02:00:00 PDT Sun Nov 6 2016


Verify that R1 is associated with the NTP server at IP address 209.165.200.225.

R1# show ntp associations

  address         ref clock       st   when   poll reach  delay  offset   disp
*~209.165.200.225 .GPS.           1     61     64   377  0.481   7.480  4.261
 * sys.peer, # selected, + candidate, - outlyer, x falseticker, ~ configured
Verify that R1 is synchronized with the NTP server at IP address 209.165.200.225.
R1# show ntp status
Clock is synchronized, stratum 2, reference is 209.165.200.225
nominal freq is 250.0000 Hz, actual freq is 249.9995 Hz, precision is 2**19
ntp uptime is 589900 (1/100 of seconds), resolution is 4016
reference time is DA088DD3.C4E659D3 (13:21:23.769 PST Tue Dec 1 2015)
clock offset is 7.0883 msec, root delay is 99.77 msec
root dispersion is 13.43 msec, peer dispersion is 2.48 msec
loopfilter state is 'CTRL' (Normal Controlled Loop), drift is 0.000001803 s/s
system poll interval is 64, last update was 169 sec ago.

You have successfully configured and verified NTP.

****************** SYSLOG **********************

Perform the following tasks to configure and generate logging messages:
Set the logging destination to 192.168.1.3
Set the trapping severity to 'Warning'-level 4
Set the logging source interface to gigabitEthernet 0/0
Force a message by creating and shutting down interface loopback 0
Bring interface loopback 0 back up

R1(config)# logging 192.168.1.3
R1(config)# logging trap 4
R1(config)# logging source-interface gigabitEthernet 0/0
R1(config)# interface loopback 0
R1(config-if)#
*Jun 12 22:06:02.902: %LINK-3-UPDOWN: Interface Loopback0, changed state to up
*Jun 12 22:06:03.902: %LINEPROTO-5-UPDOWN: Line protocol on Interface Loopback0, changed state to up
*Jun 12 22:06:03.902: %SYS-6-LOGGINGHOST_STARTSTOP: Logging to host 192.168.1.3 port 514 started - CLI initiated
R1(config-if)# shutdown
R1(config-if)#
*Jun 12 22:06:49.642: %LINK-5-CHANGED: Interface Loopback0, changed state to administratively down
*Jun 12 22:06:50.642: %LINEPROTO-5-UPDOWN: Line protocol on Interface Loopback0, changed state to down
R1(config-if)# no shutdown
R1(config-if)#
*Jun 12 22:09:18.210: %LINK-3-UPDOWN: Interface Loopback0, changed state to up
*Jun 12 22:09:19.210: %LINEPROTO-5-UPDOWN: Line protocol on Interface Loopback0, changed state to up


Return to privileged EXEC mode
Filter the 'show logging' output to include 'changed state to up'

R1(config-if)# end
R1# show logging | include changed state to up
*Jun 12 17:46:26.143: %LINK-3-UPDOWN: Interface GigabitEthernet0/1, changed state to up 
*Jun 12 17:46:26.143: %LINK-3-UPDOWN: Interface Serial0/0/1, changed state to up 
*Jun 12 17:46:27.263: %LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/1, changed state to up 
*Jun 12 17:46:27.263: %LINEPROTO-5-UPDOWN: Line protocol on Interface Serial0/0/1, changed state to up 
*Jun 12 20:28:43.427: %LINK-3-UPDOWN: Interface GigabitEthernet0/0, changed state to up 
*Jun 12 20:28:44.427: %LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0, changed state to up 
*Jun 12 22:04:11.862: %LINEPROTO-5-UPDOWN: Line protocol on Interface Loopback0, changed state to up 
*Jun 12 22:06:02.902: %LINK-3-UPDOWN: Interface Loopback0, changed state to up 
*Jun 12 22:06:03.902: %LINEPROTO-5-UPDOWN: Line protocol on Interface Loopback0, changed state to up 
*Jun 12 22:09:18.210: %LINK-3-UPDOWN: Interface Loopback0, changed state to up 
*Jun 12 22:09:19.210: %LINEPROTO-5-UPDOWN: Line protocol on Interface Loopback0, changed state to up 
*Jun 12 22:35:55.926: %LINK-3-UPDOWN: Interface Loopback0, changed state to up 
*Jun 12 22:35:56.926: %LINEPROTO-5-UPDOWN: Line protocol on Interface Loopback0, changed state to up
Filter the 'show logging' output to begin with 'Jun 12 22:35'.
R1# show logging | begin Jun 12 22:35
*Jun 12 22:35:46.206: %LINK-5-CHANGED: Interface Loopback0, changed state to administratively down 
*Jun 12 22:35:47.206: %LINEPROTO-5-UPDOWN: Line protocol on Interface Loopback0, changed state to down 
*Jun 12 22:35:55.926: %LINK-3-UPDOWN: Interface Loopback0, changed state to up 
*Jun 12 22:35:56.926: %LINEPROTO-5-UPDOWN: Line protocol on Interface Loopback0, changed state to up 
*Jun 12 22:49:52.122: %SYS-5-CONFIG_I: Configured from console by console 
*Jun 12 23:15:48.418: %SYS-5-CONFIG_I: Configured from console by console
You successfully configured and verified syslog.

************* Password Recovery *********************

The break sequence was issued during boot up on a router. Enter the following ROMMON commands to have the router ignore the startup configuration file during startup.
Issue the ROMMON command to set the register to 0x2142.
Issue the command to restart the router.

rommon 1 > confreg 0x2142
rommon 2 > reset

System Bootstrap, Version 15.0(1r)M9, RELEASE SOFTWARE (fc1)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 2010 by cisco Systems, Inc.
From Privileged EXEC mode, copy the startup configuration to the running configuration.
Router# copy startup-config running-config
Destination filename [running-config]? 
1450 bytes copied in 0.156 secs (9295 bytes/sec)


Issue the following commands to reset the enable password and reset the router to run the startup configuration upon startup.
Enter Global Configuration mode.
Set the enable password to cisco.
Change the configuration register back to 0x2102.
Return to Privilege EXEC mode using the end command.
Copy the running configuration to the startup configuration.
Reload the router.

Router# configure terminal

Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)# enable secret cisco
Router(config)# config-register 0x2102
Router(config)# end
Router# copy running-config startup-config
Destination filename [startup-config]? 

Building configuration...
[OK]
Router# reload
You have successfully performed password recovery on a router.

********************** TFTP *****************

Copy the IOS image c1900-universalk9-mz.SPA.152-4.M3.bin from flash0 to a TFTP server located at 172.16.1.100. The filename is case-sensitive.

R2# copy flash0: tftp:
Source filename []? c1900-universalk9-mz.SPA.152-4.M3.bin
Address or name of remote host []? 172.16.1.100
Destination filename [c1900-universalk9-mz.SPA.152-4.M3.bin]? 
!!!!!!!!!!!!!!!!!!
<output omitted>
68831808 bytes copied in 363.468 secs (269058 bytes/sec)
R2#

You successfully backed up the Cisco IOS to the TFTP server.


**************** Licensensing ******************8

Display the Unique Device Identifier (UDI) for R2.

R2# show license udi
Device# PID              SN            UDI 
--------------------------------------------------------------- 
*0      CISCO1941/K9     FTX16368491   CISCO1941/K9:FTX16368491 
 
R2#
You successfully displayed the UDI on R2.

Install the security license seck9-C1900-SPE150_K9-FAB12340099.xml from
flash0 and reload the router.

R2# license install flash0:seck9-C1900-SPE150_K9-FAB12340099.xml
Installing licenses from “seck9-C1900-SPE150_K9-FAB12340099.xml" 
Installing...Feature:seck9...Successful:Supported 
1/1 licenses were successfully installed 
0/1 licenses were existing licenses 
0/1 licenses were failed to install 
R2# 
*May 27 17:24:57.391: %LICENSE-6-INSTALL: Feature seck9 1.0 was installed in this 
device.  
UDI=1900-SPE150/K9:FAB12340099; StoreIndex=15:Primary License Storage 
*May 27 17:24:57.615: %IOS_LICENSE_IMAGE_APPLICATION-6-LICENSE_LEVEL: Module 
name = c1900 
Next reboot level = seck9 and License = seck9
R2# reload

You successfully installed the Security License on R2.

On router R2 perform the following tasks:
Accept the End User Agreement for the license
Install the Data Technology package for evaluation -  'datak9'
Return to privileged EXEC mode

R2(config)# license accept end user agreement
R2(config)# license boot module c1900 technology-package datak9
% use 'write' command to make license boot config take effect on next boot 
*Apr 27 01:27:01.703: %IOS_LICENSE_IMAGE_APPLICATION-6-LICENSE_LEVEL: Module name = c1900 Next reboot level = datak9 and License = datak9 
*Apr 27 01:27:02.331: %LICENSE-6-EULA_ACCEPTED: EULA for feature datak9 1.0 has been accepted. UDI=CISCO1941/K9:FTX16368491; StoreIndex=1:Built-In License Storage
R2(config)# end
R2#
*Apr 27 01:27:20.811: %SYS-5-CONFIG_I: Configured from console by console


Verify the installation of the package.

R2# show license
Index 1 Feature: ipbasek9
        Period left: Life time 
        License Type: Permanent 
        License State: Active, In Use 
        License Count: Non-Counted 
        License Priority: Medium 
Index 2 Feature: securityk9                     
        Period left: Not Activated 
        Period Used: 0  minute  0  second  
        License Type: EvalRightToUse 
        License State: Not in Use, EULA not accepted 
        License Count: Non-Counted 
        License Priority: None 
Index 3 Feature: datak9                         
        Period left: 8  weeks 4  days 
        Period Used: 0  minute  0  second  
        License Type: EvalRightToUse 
        License State: Active, Not in Use, EULA accepted 
        License Count: Non-Counted 
        License Priority: Low 
Index 4 Feature: SSL_VPN                        
        Period left: Not Activated 
        Period Used: 0  minute  0  second  
          
R2#
You successfully activated an evaluation Right-To-Use license.

On router R2 perform the following tasks:
Save all licenses to flash0:R2_license_files
Verify the file has been saved to flash0
R2# license save flash0:R2_license_files
license lines saved ..... to flash0:R2_license_files
R2# show flash0:
-#- --length-- -----date/time------ path 
1     68831808 Apr 2 2013 21:50:32  +00:00 c1900-universalk9
-mz.SPA.152-4.M3.bin 
2         1153 Apr 27 2013 01:34:32 +00:00 R2_license_files 
 
182398976 bytes available (68832961 bytes used) 
 
R2#
You successfully backed up the license on R2.

On router R2 perform the following tasks:
Disable the technology package 'seck9'
Return to privileged EXEC mode with the 'exit' command
Reload the router for changes to take effect
R2(config)# license boot module c1900 technology-package seck9 disable
R2(config)# exit
R2# reload
<Simulated reload>
Now perform the following tasks:
Clear the 'seck9' license
Enter configuration mode and remove the boot option for the license
Return to privileged EXEC mode with the 'exit' command
Reload the router for changes to take effect
R2# license clear seck9
R2# configure terminal
R2(config)# no license boot module c1900 technology-package seck9 disable
R2(config)# exit
R2# reload
<Simulated reload>
You successfully uninstalled the security license on R2.