Enter global configuration mode, create VLAN 20, name it "student", and return to global configuration mode.

S3# configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
S3(config)# vlan 20 
S3(config-vlan)# name student
S3(config-vlan)# exit
S3(config)# 

From global configuration mode, create VLAN 150, name it "VOICE" and return to global configuration mode.

S3(config)# vlan 150 
S3(config-vlan)# name VOICE
S3(config-vlan)# exit
S3(config)# 

From global configuration mode, enter interface F0/18, make it an access port and assign it VLAN 20. 

S3(config)# interface F0/18
S3(config-if)# switchport mode access
S3(config-if)# switchport access vlan 20
S3(config-if)#

Enable QoS settings to trust the CoS values, assign it to the voice VLAN, and return to privileged EXEC mode.

S3(config-if)# mls qos trust cos
S3(config-if)# switchport voice vlan 150
S3(config-if)# end
S3#

*Mar 31, 09:34:24.3434: %SYS-5-CONFIG_I: Configured from console by console


Display the brief vlan information.

S3# show vlan brief
VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Fa0/1, Fa0/2, Fa0/3, Fa0/4
                                                Fa0/5, Fa0/6, Fa0/7, Fa0/8
                                                Fa0/9, Fa0/10, Fa0/11, Fa0/12
                                                Fa0/13, Fa0/14, Fa0/15, Fa0/16
                                                Fa0/17, Fa0/19, Fa0/20, Fa0/21
                                                Fa0/22, Fa0/23, Fa0/24, Gi0/1
                                                Gi0/2
20   student                          active    Fa0/18
150  VOICE                            active    Fa0/18
1002 fddi-default                     act/unsup 
1003 token-ring-default               act/unsup 
1004 fddinet-default                  act/unsup 
1005 trnet-default                    act/unsup 
S3#
You successfully assigned a port to a data VLAN and a voice VLAN.


Ports F0/11 and F0/18 have been assigned to VLAN 20. Display the vlan information specifically for the Student vlan.

S1# show vlan name student

VLAN Name                             Status    Ports 
---- -------------------------------- --------- ------------------------------- 
20   student                          active    Fa0/11, Fa0/18 
 
VLAN Type  SAID       MTU   Parent RingNo BridgeNo Stp  BrdgMode Trans1 Trans2 
---- ----- ---------- ----- ------ ------ -------- ---- -------- ------ ------ 
20   enet  100020     1500  -      -      -        -    -        0      0   
 
Remote SPAN VLAN 
---------------- 
Disabled 
 
Primary Secondary Type              Ports 
------- --------- ----------------- ------------------------------------------
S1#

Display summary information for VLANs.

S1# show vlan summary
 Number of existing VLANs              : 7 
 Number of existing VTP VLANs          : 7 
 Number of existing extended VLANS     : 0 
 
S1#

Display the interface information for VLAN 20.

S1# show interfaces vlan 20
Vlan20 is up, line protocol is up 
  Hardware is CPU Interface, address is 0007.ec74.61d3 (bia 0007.ec74.61d3) 
  MTU 1500 bytes, BW 100000 Kbit, DLY 1000000 usec, 
     reliability 255/255, txload 1/255, rxload 1/255 
  Encapsulation ARPA, loopback not set 
  ARP type: ARPA, ARP Timeout 04:00:00 
  Last input 21:40:21, output never, output hang never 
  Last clearing of "show interface" counters never 
  Input queue: 0/75/0/0 (size/max/drops/flushes); Total output drops: 0 
  Queueing strategy: fifo 
  Output queue: 0/40 (size/max) 
  5 minute input rate 0 bits/sec, 0 packets/sec 
  5 minute output rate 0 bits/sec, 0 packets/sec 
     1682 packets input, 530955 bytes, 0 no buffer 
     Received 0 broadcasts (0 IP multicast) 
     0 runts, 0 giants, 0 throttles 
     0 input errors, 0 CRC, 0 frame, 0 overrun, 0 ignored 
     563859 packets output, 0 bytes, 0 underruns 
     0 output errors, 23 interface resets 
     0 output buffer failures, 0 output buffers swapped out 
S1#

Display the switchport information for F0/18.

S1# show interfaces F0/18 switchport
Name: Fa0/18 
Switchport: Enabled 
Administrative Mode: static access 
Operational Mode: down 
Administrative Trunking Encapsulation: dot1q 
Operational Trunking Encapsulation: native 
Negotiation of Trunking: Off 
Access Mode VLAN: 20 (Students) 
Trunking Native Mode VLAN: 1 (default) 
Voice VLAN: none 
 
<output omitted>
You successfully verified VLAN information.

******************** Trunking

Configure port f0/1 to be an 802.1q trunk. Use VLAN 99 as the native VLAN.

S1(config)# interface f0/1
S1(config-if)# switchport mode trunk
S1(config-if)# switchport trunk native vlan 99

Return directly to privileged EXEC mode. Display the switchport status of f0/1.

S1(config-if)# end
*Mar 31, 10:34:24.3434: %SYS-5-CONFIG_I: Configured from console by console

S1# show interfaces f0/1 switchport

Name: Fa0/1 
Switchport: Enabled 
Administrative Mode: trunk 
Operational Mode: trunk 
Administrative Trunking Encapsulation: dot1q 
Operational Trunking Encapsulation: dot1q 
Negotiation of Trunking: On 
Access Mode VLAN: 1 (default) 
Trunking Native Mode VLAN: 99 (VLAN0099) 
Administrative Native VLAN tagging: enabled 
Voice VLAN: none 
Administrative private-vlan host-association: none 
Administrative private-vlan mapping: none 
Administrative private-vlan trunk native VLAN: none 
Administrative private-vlan trunk Native VLAN tagging: enabled 
Administrative private-vlan trunk encapsulation: dot1q 
Administrative private-vlan trunk normal VLANs: none 
Administrative private-vlan trunk associations: none 
Administrative private-vlan trunk mappings: none 
Operational private-vlan: none 
Trunking VLANs Enabled: ALL 
Pruning VLANs Enabled: 2-1001 
Capture Mode Disabled 
Capture VLANs Allowed: ALL 
      
Protected: false 
Unknown unicast blocked: disabled 
Unknown multicast blocked: disabled 
Appliance trust: none
S1#

You successfully configured and verified port f0/1 as a trunk.

************** VLAN Routing

Configure R1 with the following:
Create subinterface .10 on the g0/0 interface
Configure the encapsulation for VLAN 10
Assign IP address 172.17.10.1/24 to the subinterface

R1(config)# interface g0/0.10
R1(config-subif)# encapsulation dot1q 10
R1(config-subif)# ip address 172.17.10.1 255.255.255.0

Create subinterface .30 on the g0/0 interface
Configure the encapsulation for VLAN 30
Assign IP address 172.17.30.1/24 to the subinterface
Activate the physical interface
Return to privileged EXEC mode

R1(config-subif)# interface g0/0.30
R1(config-subif)# encapsulation dot1q 30
R1(config-subif)# ip address 172.17.30.1 255.255.255.0
R1(config-subif)# interface g0/0
R1(config-if)# no shutdown
R1(config-if)# end
R1# 

*Mar 20 06:32:03.777: %LINK-3-UPDOWN: Interface GigabitEthernet0/0, changed state to down 
*Mar 20 06:32:04.217: %SYS-5-CONFIG_I: Configured from console by console 
*Mar 20 06:32:06.929: %LINK-3-UPDOWN: Interface GigabitEthernet0/0, changed state to up 
*Mar 20 06:32:07.929: %LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0, changed state to up

Display the VLAN information on R1.

R1# show vlan

Virtual LAN ID: 1 (IEEE 802.1Q Encapsulation) 
 vLAN Trunk Interface: GigabitEthernet0/0 
 This is configured as native Vlan for the following interface(s) : 
GigabitEthernet0/0 Native-vlan Tx-type: Untagged 
 Protocols Configured: Address: Received: Transmitted: 
 Other 0 1 
 0 packets, 0 bytes input 
 1 packets, 18 bytes output 
 
Virtual LAN ID: 10 (IEEE 802.1Q Encapsulation) 
 vLAN Trunk Interface: GigabitEthernet0/0.10 
 Protocols Configured: Address: Received: Transmitted: 
 IP 172.17.10.1 0 0 
 Other 0 1 
 0 packets, 0 bytes input 
 1 packets, 46 bytes output 
Virtual LAN ID: 30 (IEEE 802.1Q Encapsulation) 
 vLAN Trunk Interface: GigabitEthernet0/0.30 
 Protocols Configured: Address: Received: Transmitted: 
 IP 172.17.30.1 0 0 
 Other 0 1 
 0 packets, 0 bytes input 
 1 packets, 46 bytes output 
R1#

Display the routing table on R1.

R1# show ip route
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP 
 D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area 
 N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2 
 E1 - OSPF external type 1, E2 - OSPF external type 2 
 i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2 
 ia - IS-IS inter area, * - candidate default, U - per-user static route 
 o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP 
 + - replicated route, % - next hop override 
 
Gateway of last resort is not set 
 
 172.17.0.0/16 is variably subnetted, 4 subnets, 2 masks 
C 172.17.10.0/24 is directly connected, GigabitEthernet0/0.10 
L 172.17.10.1/32 is directly connected, GigabitEthernet0/0.10 
C 172.17.30.0/24 is directly connected, GigabitEthernet0/0.30 
L 172.17.30.1/32 is directly connected, GigabitEthernet0/0.30

You successfully configured Router-on-a-Stick Inter-VLAN routing.